# Khám phá và xử lý dữ liệu Marketing Campaign

## 1. Import thư viện và nạp dữ liệu vào notebook

In [1]:
import pandas as pd

In [2]:
marketing_data = pd.read_csv("marketing_campaign.csv", sep=None, engine="python")
marketing_data = marketing_data[['ID','Year_Birth', 'Education',
'Marital_Status','Income','Kidhome', 'Teenhome',
'Dt_Customer', 'Recency','NumStorePurchases',
'NumWebVisitsMonth']]

ValueError: bad delimiter value

In [ ]:
print("5 dòng đầu tiên của dữ liệu: ")
marketing_data.head(5)

In [62]:
print("5 dòng cuối cùng của dữ liệu: ")
marketing_data.tail(5)

5 dòng cuối cùng của dữ liệu:

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,4,5
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,5,7
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,13,6
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,10,3
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,4,7

In [63]:
print("Kiểu dữ liệu mỗi cột: ")
display(marketing_data.dtypes)

Kiểu dữ liệu mỗi cột:

ID                     int64
Year_Birth             int64
Education             object
Marital_Status        object
Income               float64
Kidhome                int64
Teenhome               int64
Dt_Customer           object
Recency                int64
NumStorePurchases      int64
NumWebVisitsMonth      int64
dtype: object

In [64]:
print("Số dòng, số cột của dữ liệu: ")
display(marketing_data.shape)

Số dòng, số cột của dữ liệu:

(2240, 11)

## 2. Loại bỏ dữ liệu trùng lặp

### Xóa các dòng trùng lặp

In [65]:
duplicates_count = marketing_data.duplicated().sum()
print("Số dòng trùng lặp: ", duplicates_count)

Số dòng trùng lặp:  0

In [66]:
print("Các dòng trùng lặp:")
display(marketing_data[marketing_data.duplicated()])

Các dòng trùng lặp:

Empty DataFrame
Columns: [ID, Year_Birth, Education, Marital_Status, Income, Kidhome, Teenhome, Dt_Customer, Recency, NumStorePurchases, NumWebVisitsMonth]
Index: []

In [67]:
marketing_data_duplicate = marketing_data.drop_duplicates()

### Xóa dòng có chỉ số (index) là 1

In [68]:
marketing_data.drop(labels=[1], axis=0)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,4,7
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,10,4
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,4,6
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,6,5
5,7446,1967,Master,Together,62513.0,0,1,09-09-2013,16,10,6
...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,4,5
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,5,7
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,13,6
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,10,3
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,4,7

### Xóa cột "Year_Birth"

In [69]:
marketing_data.drop(labels=['Year_Birth'], axis=1)

,ID,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth
0,5524,Graduation,Single,58138.0,0,0,04-09-2012,58,4,7
1,2174,Graduation,Single,46344.0,1,1,08-03-2014,38,2,5
2,4141,Graduation,Together,71613.0,0,0,21-08-2013,26,10,4
3,6182,Graduation,Together,26646.0,1,0,10-02-2014,26,4,6
4,5324,PhD,Married,58293.0,1,0,19-01-2014,94,6,5
...,...,...,...,...,...,...,...,...,...,...
2235,10870,Graduation,Married,61223.0,0,1,13-06-2013,46,4,5
2236,4001,PhD,Together,64014.0,2,1,10-06-2014,56,5,7
2237,7270,Graduation,Divorced,56981.0,0,0,25-01-2014,91,13,6
2238,8235,Master,Together,69245.0,0,1,24-01-2014,8,10,3
2239,9405,PhD,Married,52869.0,1,1,15-10-2012,40,4,7

## 3. Thay thế dữ liệu và thay đổi định dạng của dữ liệu

Thay thế các giá trị trong cột "Teenhome" bằng:
 - "has no teen" nếu giá trị bằng 0.
 - "has teen" nếu giá trị bằng 1.
 - "has teen" nếu giá trị bằng 2.

In [70]:
marketing_data['Teenhome_replaced'] = marketing_data['Teenhome'].replace([0,1,2],['has no teen','has teen','has teen'])
marketing_data.head(5)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth,Teenhome_replaced
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,4,7,has no teen
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,2,5,has teen
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,10,4,has no teen
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,4,6,has no teen
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,6,5,has no teen

In [71]:
display(marketing_data[['Teenhome', 'Teenhome_replaced']].head())

   Teenhome Teenhome_replaced
0         0       has no teen
1         1          has teen
2         0       has no teen
3         0       has no teen
4         0       has no teen

### Xử lý giá trị bị thiếu
  - Điền giá trị bị thiếu của cột "Income" bằng 0

In [72]:
print("Số lượng giá trị thiếu trong mỗi cột:")
display(marketing_data.isnull().sum())

Số lượng giá trị thiếu trong mỗi cột:

ID                    0
Year_Birth            0
Education             0
Marital_Status        0
Income               24
Kidhome               0
Teenhome              0
Dt_Customer           0
Recency               0
NumStorePurchases     0
NumWebVisitsMonth     0
Teenhome_replaced     0
dtype: int64

In [73]:
marketing_data['Income'] = marketing_data['Income'].fillna(0)
display(marketing_data.isnull().sum())

ID                   0
Year_Birth           0
Education            0
Marital_Status       0
Income               0
Kidhome              0
Teenhome             0
Dt_Customer          0
Recency              0
NumStorePurchases    0
NumWebVisitsMonth    0
Teenhome_replaced    0
dtype: int64

### Đổi kiểu dữ liệu
  - Đổi kiểu dữ liệu của cột "Income" từ float sang int

In [74]:
marketing_data['Income_changed'] = marketing_data['Income'].astype(int)
print(marketing_data['Income_changed'])

0       58138
1       46344
2       71613
3       26646
4       58293
        ...
2235    61223
2236    64014
2237    56981
2238    69245
2239    52869
Name: Income_changed, Length: 2240, dtype: int64

## 4. Xử lý giá trị thiếu

### Kiểm tra các giá trị bị thiếu (NaN) trong từng cột

In [75]:
marketing_data.isnull().sum()

ID                   0
Year_Birth           0
Education            0
Marital_Status       0
Income               0
Kidhome              0
Teenhome             0
Dt_Customer          0
Recency              0
NumStorePurchases    0
NumWebVisitsMonth    0
Teenhome_replaced    0
Income_changed       0
dtype: int64

### Xóa các dòng có giá trị thiếu ở bất kỳ cột nào

In [76]:
marketing_data_withoutna = marketing_data.dropna(how='any')

### Xem kích thước dữ liệu sau khi loại bỏ NaN

In [77]:
marketing_data_withoutna.shape

(2240, 13)

## 5. Kết quả

In [78]:
print("Dữ liệu sau xử lý:")
display(marketing_data.head())
print("Kích thước dữ liệu cuối cùng: ", marketing_data.shape)

Dữ liệu sau xử lý:

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth,Teenhome_replaced,Income_changed
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,4,7,has no teen,58138
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,2,5,has teen,46344
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,10,4,has no teen,71613
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,4,6,has no teen,26646
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,6,5,has no teen,58293

Kích thước dữ liệu cuối cùng:  (2240, 13)